In [18]:
import pandas as pd

In [11]:
books = pd.read_csv("BX-Books.csv", sep=",")
ratings = pd.read_csv("BX-Book-Ratings.csv", sep = ";")
users = pd.read_csv("BX-Users.csv", sep=";")

In [22]:
books = books.drop("Unnamed: 0", axis = "columns")
books = books.drop(["Image.URL.S", "Image.URL.M", "Image.URL.L"], axis = "columns")

In [25]:
books
ratings
users

        User-ID                            Location   Age
0             1                  nyc, new york, usa   NaN
1             2           stockton, california, usa  18.0
2             3     moscow, yukon territory, russia   NaN
3             4           porto, v.n.gaia, portugal  17.0
4             5  farnborough, hants, united kingdom   NaN
...         ...                                 ...   ...
278853   278854               portland, oregon, usa   NaN
278854   278855  tacoma, washington, united kingdom  50.0
278855   278856           brampton, ontario, canada   NaN
278856   278857           knoxville, tennessee, usa   NaN
278857   278858                dublin, n/a, ireland   NaN

[278858 rows x 3 columns]